# GetPointIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCollection..::..GetPointIterator Method
PointCollection Class See Also
---
Creates and returns an iterator for the points contained in this collection.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public PointIterator GetPointIterator()
```

Visual Basic
---
```text
Public Function GetPointIterator As PointIterator
```

Visual C++
---
```text
public:
PointIterator^ GetPointIterator()
```

# ### Return Value
New iterator created, make sure to call 'free' on it when finished using it.
# See Also
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace